Revit 2027 API
BuiltInFailures.StairRampFailures.BadTreadRiserProfile Property
 Tread/Riser profile is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadTreadRiserProfile { get; }
Public Shared ReadOnly Property BadTreadRiserProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadTreadRiserProfile {
	FailureDefinitionId^ get ();
}
static member BadTreadRiserProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace